{
  "recipes": [
    {
      "Veg": {
        "Breakfast": [
          {
            "Day": "Monday",
            "Title": "Greek Yogurt and Oatmeal Breakfast Bowl",
            "Ingredients": "1/2 cup rolled oats\n1 cup water\n1/2 cup plain Greek yogurt\n1/4 cup chopped nuts (almonds, pecans, or walnuts)\n1/4 cup fresh berries (blueberries, raspberries, or strawberries)\n1 tablespoon honey",
            "Instructions": "In a small saucepan, bring the rolled oats and water to a boil over medium heat.\n\nReduce the heat to low and simmer for 5 minutes, stirring occasionally, until the oats are cooked and the mixture has thickened.\n\nRemove the saucepan from the heat and let it cool for 1-2 minutes.\n\nSpoon the cooked oats into a bowl and top with the Greek yogurt, chopped nuts, fresh berries, and honey.\n\nServe and enjoy!"
          },
          {
            "Day": "Tuesday",
            "Title": "Lentils Soup",
            "Ingredients": "1 cup brown lentils, rinsed and drained\n2 cups water\n1 tablespoon vegetable oil\n1 onion, sliced\n2 garlic cloves, minced\n2 carrots, sliced\n1 bell pepper, sliced\n2 cups broccoli florets\n1/4 cup soy sauce\n1 tablespoon honey\n1 tablespoon cornstarch\nSalt and pepper, to taste",
            "Instructions": "In a medium saucepan, combine the brown lentils and water. Bring to a boil, then reduce the heat to low and simmer for 20-25 minutes, or until the lentils are tender. Drain any excess water and set aside.\nIn a large skillet, heat the vegetable oil over medium heat.\nAdd the onion and garlic, and sauté for 2-3 minutes until softened.\nAdd the carrots, bell pepper, and broccoli to the skillet, and sauté for 5-7 minutes until the vegetables are tender.\nIn a small bowl, whisk together the soy sauce, honey, and cornstarch.\nPour the soy sauce mixture over the vegetables in the skillet, and stir to coat.\nAdd the cooked lentils to the skillet, and stir to combine.\nCook for 2-3 minutes until the sauce has thickened and the lentils and vegetables are heated through.\nSeason with salt and pepper, to taste."
          },
          {
            "Day": "Wednesday",
            "Title": "Chickpea Salad",
            "Ingredients": "1 can chickpeas, rinsed and drained\n1 red bell pepper, chopped\n1/2 red onion, chopped\n1/4 cup chopped fresh parsley\n1/4 cup crumbled feta cheese\n2 tablespoons olive oil\n1 tablespoon lemon juice\n1 garlic clove, minced\nSalt and pepper, to taste",
            "Instructions": "In a large mixing bowl, combine the chickpeas, red bell pepper, red onion, and chopped parsley.\n\nIn a separate small bowl, whisk together the olive oil, lemon juice, garlic, salt, and pepper.\n\nPour the dressing over the chickpea mixture and toss to coat.\n\nSprinkle the crumbled feta cheese over the top of the salad.\n\nServe chilled or at room temperature."
          },
          {
            "Day": "Thursday",
            "Title": "Peanut Butter and Banana Sandwich",
            "Ingredients": "2 slices of whole wheat bread\n2 tablespoons creamy peanut butter\n1 ripe banana, sliced\nHoney (optional)",
            "Instructions": "Spread the peanut butter on one slice of the bread.\n\nTop with the sliced banana and drizzle with honey, if desired.\n\nTop with the second slice of bread.\n\nSlice the sandwich in half and serve."
          },
          {
            "Day": "Friday",
            "Title": "Oatmeal Breakfast Bowl",
            "Ingredients": "1/2 cup rolled oats\n1 cup milk\n1/2 banana, sliced\n1 tablespoon honey\n1 tablespoon chopped nuts (such as almonds or walnuts)\n1/2 teaspoon ground cinnamon\nPinch of salt",
            "Instructions": "In a small saucepan, bring the milk to a simmer over medium heat.\n\nAdd the rolled oats, banana, honey, cinnamon, and salt to the saucepan.\n\nStir to combine and reduce the heat to low.\n\nCook for 5-7 minutes, stirring occasionally, until the oatmeal is thick and creamy.\n\nPour the oatmeal into a bowl and top with chopped nuts.\n\nServe hot."
          },
          {
            "Day": "Saturday",
            "Title": "Veggie Breakfast Sandwich",
            "Ingredients": "2 slices of whole wheat bread\n2 tablespoons hummus\n1/4 avocado, sliced\n1/4 cup sliced cucumber\n1/4 cup sliced tomato\n1/4 cup sliced bell pepper\n1/4 cup sliced red onion\nSalt and pepper, to taste",
            "Instructions": "Toast the slices of bread to your liking.\nSpread one slice of bread with the hummus and the other with the sliced avocado.\nLayer the cucumber, tomato, bell pepper, and red onion on one slice of bread.\nSeason with salt and pepper to taste.\nTop with sprouts or microgreens, if using.\nPlace the other slice of bread on top to make a sandwich.\nServe immediately."
          },
          {
            "Day": "Sunday",
            "Title": "Quinoa Breakfast Bowl",
            "Ingredients": "/2 cup cooked quinoa\n1/2 cup plain Greek yogurt\n1/2 cup mixed berries (such as strawberries, blueberries, and raspberries)\n1 tablespoon honey\n1 tablespoon chopped nuts (such as almonds or pecans)\nPinch of cinnamon",
            "Instructions": "In a small mixing bowl, combine the cooked quinoa and Greek yogurt.\n\nTop with mixed berries, chopped nuts, and a drizzle of honey.\n\nSprinkle with cinnamon to taste.\n\nServe cold or at room temperature."
          }
        ],
        "Lunch": [
          {
            "Day": "Monday",
            "Title": "Chickpea and Vegetable Stir-Fry",
            "Ingredients": "1 cup cooked chickpeas\n1 cup mixed vegetables (such as bell pepper, onion, and broccoli)\n1 tablespoon olive oil\n2 tablespoons soy sauce\n1 teaspoon honey\nServe over 1 cup cooked brown rice.",
            "Instructions": "Heat a large skillet over medium-high heat. Add the olive oil to the skillet and let it heat up for a minute.\n\nAdd the mixed vegetables to the skillet and cook for 3-4 minutes, stirring occasionally.\n\nAdd the cooked chickpeas to the skillet and continue cooking for another 2-3 minutes, or until the vegetables are tender and the chickpeas are heated through.\n\nIn a small bowl, whisk together the soy sauce and honey. Pour the mixture over the chickpea and vegetable mixture in the skillet and stir to coat everything evenly.\n\nCook for an additional 1-2 minutes, or until the sauce has thickened slightly.\n\nServe the chickpea and vegetable stir-fry hot over cooked brown rice, if desired."
          },
          {
            "Day": "Tuesday",
            "Title": "Lentil and Vegetable Curry",
            "Ingredients": "1 cup cooked lentils\n1 cup mixed vegetables (such as cauliflower, bell pepper, and carrot)\n1 tablespoon olive oil\n1 tablespoon curry powder\n1/2 cup canned coconut milk\nServe over 1 cup cooked quinoa.",
            "Instructions": "Heat a large skillet over medium-high heat. Add the olive oil to the skillet and let it heat up for a minute.\n\nAdd the mixed vegetables to the skillet and cook for 3-4 minutes, stirring occasionally.\n\nStir in the curry powder and cook for an additional minute, or until fragrant.\n\nAdd the cooked lentils to the skillet and stir to combine everything.\n\nPour in the canned coconut milk and stir to combine. Bring the mixture to a simmer and let it cook for 5-7 minutes, or until the vegetables are tender and the sauce has thickened slightly.\n\nServe the lentil and vegetable curry hot over cooked quinoa, if desired."
          },
          {
            "Day": "Wednesday",
            "Title": "Sweet Potato and Black Bean Bowl",
            "Ingredients": "1 medium sweet potato, baked and diced\n1/2 cup canned black beans, drained and rinsed\n1/4 cup salsa\n1/4 cup diced avocado\nServe over 1 cup cooked brown rice.",
            "Instructions": "Preheat the oven to 400°F (200°C).\n\nSpread the cubed sweet potato on a baking sheet and drizzle with 1 tablespoon of olive oil. Season with salt and pepper and toss to coat everything evenly.\n\nRoast the sweet potato in the preheated oven for 20-25 minutes, or until tender and lightly browned.\n\nIn a large bowl, combine the cooked black beans, sliced avocado, and chopped cilantro. Add the roasted sweet potato to the bowl and stir everything together gently.\n\nIn a small bowl, whisk together the remaining 1 tablespoon of olive oil and the lime juice. Pour the dressing over the sweet potato and black bean mixture and stir everything together gently.\n\nServe the sweet potato and black bean bowl hot over cooked quinoa, if desired."
          },
          {
            "Day": "Thursday",
            "Title": "Grilled Veggie Sandwich",
            "Ingredients": "2 slices of whole wheat bread\n2 tablespoons hummus\n1/4 cup sliced cucumber\n1/4 cup sliced tomato\n1/4 cup sliced bell pepper\n1/4 cup sliced red onion\n1 tablespoon olive oil\n1 tablespoon balsamic vinegar",
            "Instructions": "Preheat a grill pan or outdoor grill to medium-high heat.\n\nBrush the sliced vegetables with olive oil and season with salt and pepper.\n\nGrill the vegetables for 3-4 minutes on each side, or until lightly charred and tender.\n\nToast the whole wheat bread slices until lightly browned.\n\nSpread the hummus evenly on one slice of the toasted bread. Sprinkle the crumbled feta cheese on top of the hummus.\n\nLayer the grilled vegetables on top of the feta cheese. Top with a handful of baby spinach leaves.\n\nCover the sandwich with the remaining slice of toasted bread.\n\nCut the sandwich in half and serve immediately."
          },
          {
            "Day": "Friday",
            "Title": "Quinoa and Vegetable Bowl",
            "Ingredients": "1 cup cooked quinoa\n1 cup mixed vegetables (such as zucchini, bell pepper, and onion)\n1 tablespoon olive oil\n1 tablespoon lemon juice\n1/4 cup crumbled feta cheese",
            "Instructions": "In a large bowl, combine the cooked quinoa, chopped mixed vegetables, and canned chickpeas. Stir everything together gently.\n\nIn a small bowl, whisk together the olive oil and balsamic vinegar. Pour the dressing over the quinoa and vegetable mixture and stir everything together gently.\n\nSeason the mixture with salt and pepper to taste.\n\nTop the quinoa and vegetable bowl with sliced avocado.\n\nServe the quinoa and vegetable bowl immediately, either cold or at room temperature.\n\n"
          },
          {
            "Day": "Saturday",
            "Title": "Chickpea and Avocado Salad",
            "Ingredients": "1 cup cooked chickpeas\n1/2 avocado, diced\n1/2 cup diced cucumber\n1/2 cup diced tomato\n1 tablespoon olive oil\n1 tablespoon lemon juice",
            "Instructions": "In a large bowl, combine the chickpeas, diced avocado, chopped red onion, chopped cucumber, chopped red bell pepper, and chopped fresh cilantro.\n\nIn a small bowl, whisk together the olive oil and lime juice. Pour the dressing over the chickpea and avocado mixture and stir everything together gently.\n\nSeason the mixture with salt and pepper to taste.\n\nServe the chickpea and avocado salad immediately, either cold or at room temperature."
          },
          {
            "Day": "Sunday",
            "Title": "Broccoli and Cheddar Soup",
            "Ingredients": "2 cups chopped broccoli florets\n1/2 cup grated cheddar cheese\n1 tablespoon butter\n1 tablespoon flour\n1 cup vegetable broth\n1/2 cup milk",
            "Instructions": "In a large pot, melt the butter over medium heat. Add the chopped onion and minced garlic and cook, stirring occasionally, until the onion is soft and translucent, about 5 minutes.\n\nAdd the chicken or vegetable broth to the pot and bring it to a boil.\n\nAdd the chopped broccoli to the pot and reduce the heat to low. Cover the pot and let the broccoli simmer until it is tender, about 10-15 minutes.\n\nRemove the pot from the heat and let it cool slightly.\n\nUsing an immersion blender or a regular blender, puree the soup until it is smooth.\n\nReturn the soup to the pot and stir in the heavy cream and shredded cheddar cheese until the cheese is melted and the soup is creamy.\n\nSeason the soup with salt and pepper to taste.\n\nServe the broccoli and cheddar soup immediately, garnished with additional shredded cheddar cheese if desired."
          }
        ],
        "Dinner": [
          {
            "Day": "Monday",
            "Title": "Roasted Vegetable and Quinoa Bowl",
            "Ingredients": "1 cup quinoa, rinsed\n2 cups vegetable broth\n1 sweet potato, peeled and chopped\n1 red bell pepper, chopped\n1 zucchini, chopped\n1 tablespoon olive oil\n1 teaspoon smoked paprika\nSalt and pepper to taste\n1 avocado, sliced",
            "Instructions": "Preheat the oven to 400°F (200°C).\nIn a large bowl, toss the chopped sweet potato, chopped red bell pepper, and chopped zucchini with the olive oil and smoked paprika until everything is well coated.\nSpread the vegetables out in a single layer on a baking sheet and season with salt and pepper to taste.\nRoast the vegetables in the preheated oven for 25-30 minutes, or until they are tender and lightly browned.\nIn a medium pot, bring the quinoa and vegetable broth to a boil. Reduce the heat to low and let the quinoa simmer until it is cooked and the broth is absorbed.\nDivide the cooked quinoa between bowls and top each bowl with the roasted vegetables and sliced avocado.\nServe the roasted vegetable and quinoa bowls hot."
          },
          {
            "Day": "Tuesday",
            "Title": "Vegetable Fried Rice",
            "Ingredients": "2 cups cooked brown rice\n1 tablespoon vegetable oil\n1 small onion, diced\n2 garlic cloves, minced\n1 bell pepper, chopped\n1 cup frozen mixed vegetables\n2 tablespoons soy sauce\nSalt and pepper to taste",
            "Instructions": "Heat the vegetable oil in a large skillet over medium heat.\nAdd the diced onion and minced garlic to the skillet and cook until the onion is soft and translucent, about 5 minutes.\nAdd the chopped bell pepper and frozen mixed vegetables to the skillet and cook until the vegetables are tender, about 5-7 minutes.\nAdd the cooked brown rice to the skillet and stir everything together.\nStir in the soy sauce and season the fried rice with salt and pepper to taste."
          },
          {
            "Day": "Wednesday",
            "Title": "Lentil and Vegetable Soup",
            "Ingredients": "1 tablespoon olive oil\n1 small onion, diced\n2 garlic cloves, minced\n3 cups vegetable broth\n1 can diced tomatoes\n1 cup chopped mixed vegetables (such as carrots, celery, and zucchini)\n1 cup cooked lentils\n1 teaspoon dried thyme\nSalt and pepper to taste",
            "Instructions": "Heat the olive oil in a large pot over medium heat.\nAdd the diced onion and minced garlic to the pot and cook until the onion is soft and translucent, about 5 minutes.\nAdd the vegetable broth, diced tomatoes, chopped mixed vegetables, cooked lentils, dried thyme, salt, and pepper to the pot.\nBring the soup to a boil, then reduce the heat to low and let it simmer for about 20 minutes, or until the vegetables are tender."
          },
          {
            "Day": "Thursday",
            "Title": "Vegetarian Chili",
            "Ingredients": "1 tablespoon olive oil\n1 small onion, diced\n2 garlic cloves, minced\n1 bell pepper, chopped\n1 can black beans, drained and rinsed\n1 can kidney beans, drained and rinsed\n1 can diced tomatoes\n1 cup frozen corn\n1 tablespoon chili powder\nSalt and pepper to taste",
            "Instructions": "Heat the olive oil in a large pot over medium heat.\nAdd the diced onion and minced garlic to the pot and cook until the onion is soft and translucent, about 5 minutes.\nAdd the chopped bell pepper to the pot and cook for about 3 minutes.\nAdd the drained and rinsed black beans, kidney beans, diced tomatoes, frozen corn, chili powder, salt, and pepper to the pot.\nBring the chili to a boil, then reduce the heat to low and let it simmer for about 30 minutes, or until it thickens."
          },
          {
            "Day": "Friday",
            "Title": "Spaghetti with Roasted Tomatoes and Garlic.",
            "Ingredients": "spaghetti, cherry tomatoes, garlic, olive oil, salt, pepper, Parmesan cheese.",
            "Instructions": "Preheat the oven to 400°F. Toss cherry tomatoes and garlic with olive oil, salt, and pepper, and roast for 20-25 minutes. Cook spaghetti according to package directions. Toss cooked spaghetti with the roasted tomatoes and garlic, and top with grated Parmesan cheese."
          },
          {
            "Day": "Saturday",
            "Title": "Cauliflower Fried Rice",
            "Ingredients": "cauliflower, peas, carrots, onion, garlic, eggs, soy sauce, olive oil, salt, pepper",
            "Instructions": "Grate cauliflower using a food processor or cheese grater. Sauté onion and garlic in olive oil, and add peas and carrots. Add the grated cauliflower, and cook for 5 minutes. Push the cauliflower mixture to one side of the pan, and scramble the eggs on the other side. Mix everything together, and season with soy sauce, salt, and pepper."
          },
          {
            "Day": "Sunday",
            "Title": "Spinach and Feta Stuffed Sweet Potatoes",
            "Ingredients": "sweet potatoes, spinach, feta cheese, onion, garlic, olive oil, salt, pepper",
            "Instructions": "Prick sweet potatoes with a fork, and bake at 400°F for 45-60 minutes. In a pan, sauté onion and garlic in olive oil, and add spinach. Cook until the spinach is wilted. Cut a slit in each sweet potato, and stuff with the spinach mixture and crumbled feta cheese."
          }
        ],
        "Snacks": [
          {
            "Day": "Monday",
            "Title": "Cucumber and tomato salad",
            "Ingredients": "Cucumber and tomato salad",
            "Instructions": "Mix sliced cucumbers and cherry tomatoes with a drizzle of olive oil and balsamic vinegar."
          },
          {
            "Day": "Tuesday",
            "Title": "Trail mix",
            "Ingredients": "Almonds, cashews, raisins, and dark chocolate chips.",
            "Instructions": "Mix together almonds, cashews, raisins, and dark chocolate chips."
          },
          {
            "Day": "Wednesday",
            "Title": "Avocado toast",
            "Ingredients": "Avocado, whole wheat bread",
            "Instructions": "Toast a slice of whole wheat bread, and top with mashed avocado, salt, and pepper."
          },
          {
            "Day": "Thursday",
            "Title": "Baked sweet potato fries",
            "Ingredients": "sweet potato",
            "Instructions": "Cut sweet potatoes into thin fries, toss with olive oil and seasonings, and bake in the oven at 400°F for 20-30 minutes."
          },
          {
            "Day": "Friday",
            "Title": "Greek yogurt with berries",
            "Ingredients": "Greek yogurt, berries",
            "Instructions": "Top a serving of Greek yogurt with mixed berries."
          },
          {
            "Day": "Saturday",
            "Title": "Hummus and veggies",
            "Ingredients": "Carrots, celery, and bell peppers.",
            "Instructions": "Dip sliced carrots, celery, and bell peppers in hummus."
          },
          {
            "Day": "Sunday",
            "Title": "Roasted chickpeas",
            "Ingredients": "Chickpeas",
            "Instructions": "Rinse and drain a can of chickpeas. Toss with olive oil and seasonings, and roast in the oven at 400°F for 20-30 minutes."
          }

        ]
      },
      "NonVeg": {
        "Breakfast": [
          {
            "Day": "Monday",
            "Title": "Bacon and egg breakfast sandwich",
            "Ingredients": "2 slices of bread\n2 slices of bacon\n1 egg\n1 slice of cheddar cheese\nButter or oil for frying",
            "Instructions": "Cook the bacon until crispy. Remove from pan and set aside. Beat the egg in a bowl and fry in the same pan with butter or oil. Toast the bread and assemble the sandwich with the bacon, egg, and cheese."
          },

          {
            "Day": "Tuesday",
            "Title": "Ham and cheese omelette",
            "Ingredients": "2 eggs\n1 slice of ham, diced\n1/4 cup shredded cheddar cheese\nSalt and pepper to taste\nButter for frying",
            "Instructions": "Beat the eggs with salt and pepper. Melt butter in a non-stick pan over medium heat. Pour in the eggs and let cook for a minute. Add the ham and cheese to one side of the omelette. Fold the other side over the filling and cook until the cheese is melted."
          },

          {
            "Day": "Wednesday",
            "Title": "Breakfast burrito",
            "Ingredients": "1 tortilla\n2 eggs\n1/4 cup cooked sausage, crumbled\n1/4 cup shredded cheddar cheese\nSalt and pepper to taste\nSalsa and sour cream for serving",
            "Instructions": "Beat the eggs with salt and pepper. Fry in a non-stick pan with butter or oil. Warm the tortilla in the microwave or on a griddle. Add the cooked sausage, eggs, and cheese to the tortilla. Fold into a burrito and serve with salsa and sour cream."
          },

          {
            "Day": "Thursday",
            "Title": "Smoked salmon and cream cheese bagel",
            "Ingredients": "1 bagel\n2 oz smoked salmon\n2 tbsp cream cheese\n1 slice of red onion\n1 slice of tomato\nCapers for garnish",
            "Instructions": "Toast the bagel. Spread cream cheese on both halves. Top with smoked salmon, onion, and tomato. Garnish with capers."
          },

          {
            "Day": "Friday",
            "Title": "Steak and egg breakfast skillet",
            "Ingredients": "2 eggs\n1/2 cup cooked steak, diced\n1/2 cup diced potatoes\n1/4 cup diced bell pepper\nSalt and pepper to taste\nButter for frying",
            "Instructions": "Melt butter in a skillet over medium heat. Add the potatoes and cook until golden brown. Add the bell pepper and steak and cook for 1-2 minutes. Beat the eggs with salt and pepper and pour into the skillet. Cook until the eggs are set.\n\n"
          },

          {
            "Day": "Saturday",
            "Title": "Huevos rancheros",
            "Ingredients": "2 eggs\n1 tortilla\n1/4 cup black beans\n1/4 cup salsa\n1/4 cup shredded cheddar cheese\nSalt and pepper to taste\nOil for frying",
            "Instructions": "Heat oil in a skillet over medium heat. Fry the tortilla until crispy. Spread the black beans over the tortilla. Fry the eggs in the same skillet. Place the eggs on top."
          },

          {
            "Day": "Sunday",
            "Title": "Breakfast Sandwich",
            "Ingredients": "English muffin, fried egg, cooked bacon or sausage, cheese.",
            "Instructions": "Fry the egg, then assemble the sandwich with the English muffin, fried egg, cooked bacon or sausage, and cheese."
          }

        ],
        "Lunch": [
          {
            "Day": "Monday",
            "Title": "Chicken Caesar Salad",
            "Ingredients": "Grilled chicken, romaine lettuce, croutons, grated Parmesan cheese, Caesar dressing.",
            "Instructions": "Arrange romaine lettuce on a plate, then top with grilled chicken, croutons, grated Parmesan cheese, and Caesar dressing."
          },
          {
            "Day": "Tuesday",
            "Title": "Chicken Fajita Bowl",
            "Ingredients": "Grilled chicken, bell peppers, onions, black beans, brown rice, salsa, guacamole.",
            "Instructions": "Cook brown rice according to package instructions. Sauté sliced bell peppers and onions until tender. Serve with grilled chicken, black beans, salsa, and guacamole."
          },

          {
            "Day": "Wednesday",
            "Title": "Chicken and Broccoli Stir-Fry",
            "Ingredients": "Grilled chicken, broccoli, carrots, onions, garlic, soy sauce, rice.",
            "Instructions": "Sauté sliced onions and minced garlic until fragrant. Add sliced chicken and cook until browned. Add sliced broccoli and carrots, then stir in soy sauce. Serve over rice."
          },

          {
            "Day": "Thursday",
            "Title": "Turkey Club Sandwich",
            "Ingredients": "Sliced turkey, bacon, lettuce, tomato, mayonnaise, bread.",
            "Instructions": "Toast bread, then layer sliced turkey, cooked bacon, lettuce, tomato, and mayonnaise."
          },

          {
            "Day": "Friday",
            "Title": "Beef Stir-Fry",
            "Ingredients": "Salmon fillet, lemon, dill, salt, pepper, asparagus.",
            "Instructions": "Preheat oven to 400°F. Season salmon fillet with lemon, dill, salt, and pepper. Bake for 12-15 minutes. Serve with roasted asparagus."
          },

          {
            "Day": "Saturday",
            "Title": "Tuna Salad",
            "Ingredients": "Canned tuna, celery, red onion, mayonnaise, salt, pepper, whole wheat bread.",
            "Instructions": "Drain canned tuna, then mix with chopped celery, chopped red onion, mayonnaise, salt, and pepper. Serve on whole wheat bread.\n"
          },

          {
            "Day": "Sunday",
            "Title": "Beef Tacos",
            "Ingredients": "Ground beef, taco seasoning, shredded cheese, diced tomato, shredded lettuce, sour cream, taco shells.",
            "Instructions": "Brown ground beef, then stir in taco seasoning. Assemble tacos with beef, shredded cheese, diced tomato, shredded lettuce, and sour cream."
          }

        ],
        "Dinner": [
          {
            "Day": "Monday",
            "Title": "Shrimp Scampi",
            "Ingredients": "1 pound large shrimp, peeled and deveined\n1/4 cup butter\n3 cloves garlic, minced\n1/2 cup white wine\nJuice of 1 lemon\nSalt and pepper to taste\n8 ounces linguine pasta\n2 tablespoons chopped fresh parsley",
            "Instructions": "Cook the pasta according to package instructions.\n\nIn a skillet, melt the butter over medium heat.\n\nAdd the garlic and sauté for 1 minute.\n\nAdd the shrimp and cook until pink, about 2-3 minutes per side.\n\nAdd the white wine and lemon juice, and cook for 2-3 minutes until the sauce has thickened.\n\nSeason with salt and pepper.\n\nServe the shrimp and sauce over the cooked pasta, and garnish with chopped parsley."
          },

          {
            "Day": "Tuesday",
            "Title": "Beef Stir-Fry",
            "Ingredients": "1 pound flank steak, sliced thinly\n1 tablespoon cornstarch\n1 tablespoon soy sauce\n2 tablespoons vegetable oil\n1 red bell pepper, sliced\n1 yellow onion, sliced\n1 cup sliced mushrooms\n1 cup snow peas\nSalt and pepper to taste\nCooked rice or noodles for serving",
            "Instructions": "In a bowl, mix the cornstarch and soy sauce.\n\nAdd the sliced beef to the bowl and toss to coat.\n\nHeat the vegetable oil in a wok or large skillet over high heat.\n\nAdd the beef and stir-fry for 2-3 minutes until browned.\n\nRemove the beef from the pan and set aside.\n\nAdd the bell pepper, onion, mushrooms, and snow peas to the pan, and stir-fry for 3-4 minutes until tender.\n\nReturn the beef to the pan and season with salt and pepper.\n\nServe the beef stir-fry with cooked rice or noodles."
          },

          {
            "Day": "Wednesday",
            "Title": "Grilled Salmon with Sweet Potato Mash",
            "Ingredients": "4 salmon fillets\n1 tablespoon olive oil\n1 teaspoon salt\n1/2 teaspoon black pepper\nJuice of 1 lemon\n2 sweet potatoes, peeled and cubed\n2 tablespoons butter\n1/4 cup milk\n1/4 teaspoon cinnamon\n1/4 teaspoon nutmeg",
            "Instructions": "Preheat grill to medium-high heat.\n\nSeason salmon fillets with salt, pepper, and lemon juice.\n\nGrill salmon for 4-5 minutes per side or until fully cooked.\n\nBoil sweet potatoes in a pot of water until tender.\n\nDrain the water and mash sweet potatoes with milk, butter, cinnamon, and nutmeg.\n\nServe grilled salmon with sweet potato mash."
          },

          {
            "Day": "Thursday",
            "Title": "Grilled Chicken with Roasted Vegetables",
            "Ingredients": "4 chicken breasts\nSalt and pepper\n2 tablespoons olive oil\n1 teaspoon garlic powder\n1 teaspoon dried thyme\n1 teaspoon dried rosemary\n1 teaspoon dried oregano\n2 zucchinis, sliced\n2 bell peppers, sliced\n1 onion, sliced",
            "Instructions": "Preheat grill to medium-high heat.\n\nSeason chicken breasts with salt, pepper, garlic powder, thyme, rosemary, and oregano.\n\nBrush chicken breasts with olive oil.\n\nGrill chicken for 6-8 minutes per side, or until cooked through.\n\nIn a separate baking dish, toss sliced zucchini, bell peppers, and onions with olive oil, salt, and pepper.\n\nRoast vegetables in the oven at 400°F for 20-25 minutes, or until tender.\n\nServe grilled chicken with roasted vegetables."
          },

          {
            "Day": "Friday",
            "Title": "Egg Fried Rice",
            "Ingredients": "3 cups cooked white rice\n2 tablespoons vegetable oil\n2 eggs, beaten\n1 cup frozen peas and carrots\n1/2 cup diced ham\n1/4 cup soy sauce\n2 green onions, sliced",
            "Instructions": "Heat vegetable oil in a large skillet over medium-high heat.\n\nAdd beaten eggs and scramble until cooked through. Remove from skillet and set aside.\n\nAdd frozen peas and carrots to the skillet and stir-fry for 2-3 minutes.\n\nAdd diced ham and cooked rice and stir-fry for another 3-4 minutes.\n\nPour in soy sauce and stir to combine.\n\nAdd scrambled eggs back to the skillet and stir to combine.\n\nServe with sliced green onions on top."
          },

          {
            "Day": "Saturday",
            "Title": "Spinach and Feta Omelette",
            "Ingredients": "3 eggs\n1/4 cup crumbled feta cheese\n1 cup fresh spinach\nSalt and pepper\n1 tablespoon butter",
            "Instructions": "Beat eggs in a bowl and season with salt and pepper.\n\nMelt butter in a non-stick skillet over medium heat.\n\nAdd fresh spinach and sauté until wilted.\n\nPour beaten eggs over the spinach and let cook for 1-2 minutes.\n\nSprinkle crumbled feta cheese over the eggs and fold in half.\n\nCook until eggs are set and cheese is melted.\n\nServe hot."
          },

          {
            "Day": "Sunday",
            "Title": "Grilled Salmon with Lemon and Herbs",
            "Ingredients": "4 salmon fillets, skin-on\nSalt and pepper\n2 tablespoons olive oil\n2 lemons, sliced\n4 sprigs fresh rosemary\n4 sprigs fresh thyme",
            "Instructions": "Preheat grill to medium-high heat.\n\nSeason salmon fillets with salt and pepper.\n\nBrush both sides of the fillets with olive oil.\n\nPlace salmon fillets on the grill, skin-side down.\n\nAdd lemon slices, rosemary, and thyme on top of each fillet.\n\nGrill for 4-6 minutes per side, or until the fish is cooked through and flakes easily with a fork.\n\nServe immediately."
          }

        ],
        "Snacks": [
          {
            "Day": "Monday",
            "Title": "Deviled Eggs",
            "Ingredients": "6 hard-boiled eggs\n1/4 cup mayonnaise\n1 teaspoon Dijon mustard\n1/4 teaspoon salt\n1/8 teaspoon black pepper\nPaprika, for garnish",
            "Instructions": "Cut the hard-boiled eggs in half lengthwise.\n\nRemove the yolks and place them in a small bowl.\n\nMash the yolks with a fork.\n\nAdd mayonnaise, Dijon mustard, salt, and black pepper to the bowl with the yolks.\n\nMix everything together until it's smooth.\n\nSpoon the yolk mixture back into the egg white halves.\n\nSprinkle paprika on top of the deviled eggs for garnish."
          },

          {
            "Day": "Tuesday",
            "Title": "Egg Salad Sandwich",
            "Ingredients": "6 hard-boiled eggs, peeled and chopped\n1/4 cup mayonnaise\n1 tablespoon Dijon mustard\n1/4 teaspoon salt\n1/8 teaspoon black pepper\n4 slices bread\nLettuce, for serving",
            "Instructions": "n a bowl, mix together the chopped hard-boiled eggs, mayonnaise, Dijon mustard, salt, and black pepper.\n\nToast the bread slices.\n\nPlace lettuce on two slices of the bread.\n\nSpoon the egg salad on top of the lettuce.\n\nTop the egg salad with the remaining bread slices.\n\nCut the sandwiches in half and serve."
          },

          {
            "Day": "Wednesday",
            "Title": "Scotch Eggs",
            "Ingredients": "6 hard-boiled eggs, peeled\n1 pound ground pork sausage\n1/2 cup bread crumbs\n1/4 teaspoon salt\n1/8 teaspoon black pepper\n1/4 teaspoon dried thyme\n1/4 teaspoon dried parsley\n1/4 teaspoon garlic powder\n1 egg, beaten\nVegetable oil, for frying",
            "Instructions": "In a bowl, mix together the ground pork sausage, bread crumbs, salt, black pepper, dried thyme, dried parsley, and garlic powder.\n\nDivide the sausage mixture into 6 equal portions.\n\nFlatten one portion of the sausage mixture in your hand.\n\nWrap one hard-boiled egg with the flattened sausage mixture.\n\nRepeat with the remaining eggs and sausage mixture.\n\nDip each sausage-wrapped egg into the beaten egg.\n\nRoll each sausage-wrapped egg in bread crumbs.\n\nHeat vegetable oil in a deep fryer or a pot over medium heat.\n\nFry each sausage-wrapped egg for about 5-6 minutes or until golden brown.\n\nRemove the sausage-wrapped eggs from the oil with a slotted spoon and place them on paper towels to drain excess oil.\n\nServe the Scotch eggs hot or cold."
          },

          {
            "Day": "Thursday",
            "Title": "Egg Muffins",
            "Ingredients": "6 eggs\n1/4 cup milk\n1/4 teaspoon salt\n1/8 teaspoon black pepper\n1/2 cup chopped vegetables (such as spinach, tomatoes, onions, and bell peppers)\n1/4 cup shredded cheese",
            "Instructions": "Preheat the oven to 350°F.\nWhisk together eggs, milk, salt, and black pepper in a bowl.\nGrease a muffin tin with cooking spray.\nPour the egg mixture into the muffin cups, filling each one about 2/3 full.\nAdd chopped vegetables to each muffin cup.\nSprinkle shredded cheese on top of the vegetables.\nBake the egg"
          },

          {
            "Day": "Friday",
            "Title": "Salmon Cakes",
            "Ingredients": "2 cups cooked salmon, flaked\n1/2 cup panko breadcrumbs\n1/4 cup mayonnaise\n1/4 cup chopped red onion\n1/4 cup chopped celery\n1/4 cup chopped fresh parsley\n1 tablespoon Dijon mustard\n1 tablespoon lemon juice\n2 teaspoons Old Bay seasoning\nSalt and pepper to taste\n2 eggs, beaten\nOlive oil for frying",
            "Instructions": "In a large mixing bowl, combine cooked salmon, panko breadcrumbs, mayonnaise, chopped red onion, chopped celery, chopped fresh parsley, Dijon mustard, lemon juice, Old Bay seasoning, salt, and pepper.\n\nMix until well combined.\n\nAdd beaten eggs to the mixture and mix until everything is evenly coated.\n\nForm the mixture into small patties.\n\nHeat olive oil in a large skillet over medium-high heat.\n\nFry salmon cakes until golden brown on both sides.\n\nDrain on paper towels before serving."
          },

          {
            "Day": "Saturday",
            "Title": "Salmon Salad Stuffed Avocado",
            "Ingredients": "2 ripe avocados, halved and pitted\n1 cup cooked salmon, flaked\n1/4 cup chopped red onion\n1/4 cup chopped celery\n1/4 cup chopped fresh parsley\n1 tablespoon Dijon mustard\n1 tablespoon lemon juice\nSalt and pepper to taste",
            "Instructions": "In a medium mixing bowl, combine cooked salmon, chopped red onion, chopped celery, chopped fresh parsley, Dijon mustard, lemon juice, salt, and pepper.\n\nMix until well combined.\n\nScoop out some of the avocado flesh from each half to create a hollow.\n\nFill each avocado half with the salmon salad.\n\nServe immediately."
          },

          {
            "Day": "Sunday",
            "Title": "Classic Ham and Cheese Sandwich",
            "Ingredients": "2 slices of bread\n2-3 slices of ham\n2 slices of cheddar cheese\n1-2 tablespoons mayonnaise\n1-2 teaspoons mustard\nLettuce and tomato (optional)",
            "Instructions": "Toast the bread slices if desired.\n\nSpread mayonnaise and mustard on one or both slices of bread.\n\nPlace ham slices on one slice of bread.\n\nAdd cheese slices on top of the ham.\n\nTop with lettuce and tomato if desired.\n\nClose the sandwich with the other slice of bread.\n\nServe immediately."
          }

        ]
      }
    }
  ]
}